app/controllers/admin/users_controller.rb

SELECT "users".* FROM "users" LIMIT $1 OFFSET $2  [["LIMIT", 2], ["OFFSET", 0]]
SELECT COUNT(*) FROM "users"
---
  def index
    @users = User.page(params[:page])

SELECT "daily_attendances".* FROM "daily_attendances" WHERE "daily_attendances"."user_id" = $1  [["user_id", 2]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def attendance
    @attendance = User.find(params[:id]).daily_attendances

INSERT INTO "users" ("email", "encrypted_password", "first_name", "last_name", "role", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save

DELETE FROM "users" WHERE "users"."id" = $1  [["id", 1]]
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 14]]
UPDATE "users" SET "last_name" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["last_name", "gupta"], ["updated_at", "2021-08-07 09:35:10.483783"], ["id", 9]]
---
  def update
    respond_to do |format|

    # User without password update data
    if params[:user][:password].blank?
      params[:user].delete(:password)
      params[:user].delete(:password_confirmation)
    end

    if @user.update(user_params)

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def set_article
    @user = User.find(params[:id])