app/views/home/index.html.erb

    <tbody>
      <% current_user.daily_attendances.each do |attendance| %>
---
SELECT "daily_attendances".* FROM "daily_attendances" WHERE "daily_attendances"."user_id" = $1  [["user_id", 3]]