app/controllers/users/sessions_controller.rb

INSERT INTO "daily_attendances" ("attendance_date", "in_time", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["attendance_date", "2021-07-28"], ["in_time", "2021-07-28 09:53:11.855426"], ["user_id", 2], ["created_at", "2021-07-28 09:53:11.920867"], ["updated_at", "2021-07-28 09:53:11.920867"]]
---
  def create
    user = current_user
    #binding.pry
    user.daily_attendances.create(
      attendance_date: Date.current,
      in_time: DateTime.current
    )

SELECT "daily_attendances".* FROM "daily_attendances" WHERE "daily_attendances"."user_id" = $1 ORDER BY "daily_attendances"."id" DESC LIMIT $2  [["user_id", 2], ["LIMIT", 1]]
UPDATE "daily_attendances" SET "out_time" = $1, "updated_at" = $2 WHERE "daily_attendances"."id" = $3  [["out_time", "2021-07-28 09:53:41.417026"], ["updated_at", "2021-07-28 09:53:41.419042"], ["id", 1]]
---
  def destroy
    user = current_user
    user.daily_attendances.last.update(
      out_time: DateTime.current
    )